driver-tests/bpelse/assign/AssignJbi/test/CopyidInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:MissingOperatorsTNS">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
  <dataPart>
		<data>test data</data>
		<optional_data>optional</optional_data>
		<start_counter>1</start_counter>
		<end_counter>0</end_counter>
   </dataPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
